In [1]:
import os
import pandas as pd

df = pd.read_csv("https://data.heatonresearch.com/data/t81-558/auto-mpg.csv")
print(df[0:5])

    mpg  cylinders  displacement horsepower  weight  acceleration  year  \
0  18.0          8         307.0        130    3504          12.0    70
1  15.0          8         350.0        165    3693          11.5    70
2  18.0          8         318.0        150    3436          11.0    70
3  16.0          8         304.0        150    3433          12.0    70
4  17.0          8         302.0        140    3449          10.5    70

   origin                       name
0       1  chevrolet chevelle malibu
1       1          buick skylark 320
2       1         plymouth satellite
3       1              amc rebel sst
4       1                ford torino

In [2]:
display(df[0:5])

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [3]:
df.dtypes

mpg             float64
cylinders         int64
displacement    float64
horsepower       object
weight            int64
acceleration    float64
year              int64
origin            int64
name             object
dtype: object

In [4]:
df = df.select_dtypes(include=['int64', 'float'])

In [5]:
df

      mpg  cylinders  displacement  weight  acceleration  year  origin
0    18.0          8         307.0    3504          12.0    70       1
1    15.0          8         350.0    3693          11.5    70       1
2    18.0          8         318.0    3436          11.0    70       1
3    16.0          8         304.0    3433          12.0    70       1
4    17.0          8         302.0    3449          10.5    70       1
..    ...        ...           ...     ...           ...   ...     ...
393  27.0          4         140.0    2790          15.6    82       1
394  44.0          4          97.0    2130          24.6    82       2
395  32.0          4         135.0    2295          11.6    82       1
396  28.0          4         120.0    2625          18.6    82       1
397  31.0          4         119.0    2720          19.4    82       1

[398 rows x 7 columns]

In [6]:
headers = list(df.columns.values)
print(headers)

['mpg', 'cylinders', 'displacement', 'weight', 'acceleration', 'year', 'origin']

In [7]:
fields = []

for field in headers:
    fields.append({
        'name': field,
        'mean': df[field].mean(),
        'var': df[field].var(),
        'std': df[field].std()
    })

In [8]:
for f in fields:
    display(f)

{'name': 'mpg',
 'mean': 23.514572864321615,
 'var': 61.089610774274405,
 'std': 7.815984312565782}

{'name': 'cylinders',
 'mean': 5.454773869346734,
 'var': 2.8934154399199943,
 'std': 1.7010042445332094}

{'name': 'displacement',
 'mean': 193.42587939698493,
 'var': 10872.199152247364,
 'std': 104.26983817119581}

{'name': 'weight',
 'mean': 2970.424623115578,
 'var': 717140.9905256768,
 'std': 846.8417741973271}

{'name': 'acceleration',
 'mean': 15.568090452261291,
 'var': 7.604848233611381,
 'std': 2.7576889298126757}

{'name': 'year',
 'mean': 76.01005025125629,
 'var': 13.672442818627143,
 'std': 3.697626646732623}

{'name': 'origin',
 'mean': 1.5728643216080402,
 'var': 0.6432920268850575,
 'std': 0.8020548777266163}

In [9]:
# Converting ^ this to Dataframe makes it allow nicer display

df2 = pd.DataFrame(fields)
df2

           name         mean            var         std
0           mpg    23.514573      61.089611    7.815984
1     cylinders     5.454774       2.893415    1.701004
2  displacement   193.425879   10872.199152  104.269838
3        weight  2970.424623  717140.990526  846.841774
4  acceleration    15.568090       7.604848    2.757689
5          year    76.010050      13.672443    3.697627
6        origin     1.572864       0.643292    0.802055

### Missing values

In [10]:
import os
import pandas as pd

df = pd.read_csv("https://data.heatonresearch.com/data/t81-558/auto-mpg.csv",
                na_values=["NA", "?"])

In [11]:
df.dtypes

mpg             float64
cylinders         int64
displacement    float64
horsepower      float64
weight            int64
acceleration    float64
year              int64
origin            int64
name             object
dtype: object

In [12]:
print(f"horsepower has na? {pd.isnull(df['horsepower']).values.any()}")

horsepower has na? True

In [13]:
median = df['horsepower'].median()
df['horsepower'] = df['horsepower'].fillna(median)

In [14]:
print(f"horsepower has na? {pd.isnull(df['horsepower']).values.any()}")

horsepower has na? False

### Dealing with outliers

In [15]:
# Remove all rows where the specified column is +/- sd standard deviations
import numpy as np

def remove_outliers(df, name, sd):
    drop_rows = df.index[(np.abs(df[name] - df[name].mean())
                          >= (sd * df[name].std()))]
    df.drop(drop_rows, axis=0, inplace=True)

In [16]:
df = pd.read_csv(
    "https://data.heatonresearch.com/data/t81-558/auto-mpg.csv",
    na_values=['NA','?'])

# create feature vector
med = df['horsepower'].median()
df['horsepower'] = df['horsepower'].fillna(med)

# drop the name from the table
df.drop('name',1,inplace=True)

# remove outliers 
remove_outliers(df, 'mpg', 2)

In [17]:
print("Length after MPG outliers dropped: {}".format(len(df)))

Length after MPG outliers dropped: 388

In [18]:
display(df[0:5])

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin
0,18.0,8,307.0,130.0,3504,12.0,70,1
1,15.0,8,350.0,165.0,3693,11.5,70,1
2,18.0,8,318.0,150.0,3436,11.0,70,1
3,16.0,8,304.0,150.0,3433,12.0,70,1
4,17.0,8,302.0,140.0,3449,10.5,70,1

### Droping fields

In [19]:
import os
import pandas as pd

df = pd.read_csv(
    "https://data.heatonresearch.com/data/t81-558/auto-mpg.csv",
    na_values=['NA','?'])

In [20]:
print(f"Before drop: {list(df.columns)}")

Before drop: ['mpg', 'cylinders', 'displacement', 'horsepower', 'weight', 'acceleration', 'year', 'origin', 'name']

In [21]:
df.drop('name', 1, inplace=True)

In [22]:
print(f"After drop: {list(df.columns)}")

After drop: ['mpg', 'cylinders', 'displacement', 'horsepower', 'weight', 'acceleration', 'year', 'origin']

### Concatenating rows and columns

In [24]:
# Create a new dataframe from name and horsepower

import os
import pandas as pd

df = pd.read_csv(
    "https://data.heatonresearch.com/data/t81-558/auto-mpg.csv",
    na_values=['NA','?'])

In [27]:
col_horsepower = df['horsepower']
col_name = df['name']
concate = pd.concat([col_name, col_horsepower], axis=1) # AXIS 1 MEANS COLUMN WISE

In [28]:
concate.head()

                        name  horsepower
0  chevrolet chevelle malibu       130.0
1          buick skylark 320       165.0
2         plymouth satellite       150.0
3              amc rebel sst       150.0
4                ford torino       140.0

In [29]:
import os
import pandas as pd

df = pd.read_csv(
    "https://data.heatonresearch.com/data/t81-558/auto-mpg.csv",
    na_values=['NA','?'])

In [30]:
display(df[0:5])

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,1,ford torino

In [32]:
display(df[-5:])

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
393,27.0,4,140.0,86.0,2790,15.6,82,1,ford mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,2,vw pickup
395,32.0,4,135.0,84.0,2295,11.6,82,1,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,1,chevy s-10

In [33]:
row_concat = pd.concat([df[0:2], df[-2:]], axis=0)

In [35]:
display(row_concat)

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,1,buick skylark 320
396,28.0,4,120.0,79.0,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,1,chevy s-10

### Training and Validation

In [36]:
import os
import pandas as pd
import numpy as np

df = pd.read_csv(
    "https://data.heatonresearch.com/data/t81-558/auto-mpg.csv",
    na_values=['NA','?'])

In [37]:
# Shuffle the data 
df = df.reindex(np.random.permutation(df.index))

In [39]:
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
140,14.0,8,304.0,150.0,4257,15.5,74,1,amc matador (sw)
127,19.0,6,232.0,100.0,2901,16.0,74,1,amc hornet
182,28.0,4,107.0,86.0,2464,15.5,76,2,fiat 131
195,29.0,4,85.0,52.0,2035,22.2,76,1,chevrolet chevette
49,23.0,4,122.0,86.0,2220,14.0,71,1,mercury capri 2000

In [40]:
mask = np.random.rand(len(df)) < 0.8

train_df = pd.DataFrame(df[mask])
validation_df = pd.DataFrame(df[~mask])

print(f"Training DF: {len(train_df)}")
print(f"Validation DF: {len(validation_df)}")

Training DF: 327
Validation DF: 71

### Converting a Dataframe to a Matrix
Neural networks do not directly operate on Python dataframes. A neural network requires a numeric matrix. The values property of a dataframe is used to convert to a matrix.

In [41]:
df.values

array([[14.0, 8, 304.0, ..., 74, 1, 'amc matador (sw)'],
       [19.0, 6, 232.0, ..., 74, 1, 'amc hornet'],
       [28.0, 4, 107.0, ..., 76, 2, 'fiat 131'],
       ...,
       [25.0, 4, 116.0, ..., 76, 2, 'opel 1900'],
       [15.0, 6, 250.0, ..., 74, 1, 'chevrolet nova'],
       [27.0, 4, 151.0, ..., 82, 1, 'pontiac phoenix']], dtype=object)

In [44]:
df_matrix = df[['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'year', 'origin']].values

In [46]:
type(df_matrix)

numpy.ndarray

### Saving a Dataframe to CSV

In [50]:
import os
import pandas as pd
import numpy as np
import pickle

In [51]:
path = "C:/Users/sadma/OneDrive/Desktop/NSU Grads/path"

In [52]:
df = pd.read_csv(
    "https://data.heatonresearch.com/data/t81-558/auto-mpg.csv",
    na_values=['NA','?'])

In [53]:
file_write = os.path.join(path, "auto-mpg-shuffle.pickle")

In [54]:
df = df.reindex(np.random.permutation(df.index))

In [56]:
with open(file_write, "wb") as fp:
    pickle.dump(df, fp)

print("done")

done

In [61]:
# Loading from Pickle file

path = "C:/Users/sadma/OneDrive/Desktop/NSU Grads/path" # path of the pickle file
file_read = os.path.join(path, "auto-mpg-shuffle.pickle") # name of the pickle file


with open(file_read, "rb") as fp:
    df = pickle.load(fp)
    
display(df[0:5])

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
9,15.0,8,390.0,190.0,3850,8.5,70,1,amc ambassador dpl
109,21.0,4,140.0,72.0,2401,19.5,73,1,chevrolet vega
235,26.0,4,97.0,75.0,2265,18.2,77,3,toyota corolla liftback
98,16.0,6,250.0,100.0,3278,18.0,73,1,chevrolet nova custom
83,28.0,4,98.0,80.0,2164,15.0,72,1,dodge colt (sw)

### Encoding categorical Values as Dummies

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(
    "https://data.heatonresearch.com/data/t81-558/jh-simple-dataset.csv",
    na_values=['NA','?'])

display(df[0:5])

,id,job,area,income,aspect,subscriptions,dist_healthy,save_rate,dist_unhealthy,age,pop_dense,retail_dense,crime,product
0,1,vv,c,50876.0,13.100000,1,9.017895,35,11.738935,49,0.885827,0.492126,0.071100,b
1,2,kd,c,60369.0,18.625000,2,7.766643,59,6.805396,51,0.874016,0.342520,0.400809,c
2,3,pe,c,55126.0,34.766667,1,3.632069,6,13.671772,44,0.944882,0.724409,0.207723,b
3,4,11,c,51690.0,15.808333,1,5.372942,16,4.333286,50,0.889764,0.444882,0.361216,b
4,5,kl,d,28347.0,40.941667,3,3.822477,20,5.967121,38,0.744094,0.661417,0.068033,a

In [4]:
display(df['area'].head(10))

0    c
1    c
2    c
3    c
4    d
5    c
6    d
7    a
8    c
9    a
Name: area, dtype: object

In [5]:
# See how many categories are there
areas = list(df['area'].unique())

In [6]:
areas

['c', 'd', 'a', 'b']

In [8]:
dummies = pd.get_dummies(['a', 'b', 'c', 'd'], prefix='area')
print(dummies)

   area_a  area_b  area_c  area_d
0       1       0       0       0
1       0       1       0       0
2       0       0       1       0
3       0       0       0       1